app/views/outfits/edit.html.erb

SELECT "items".* FROM "items" INNER JOIN "outfit_items" ON "items"."id" = "outfit_items"."item_id" WHERE "outfit_items"."outfit_id" = ?  [["outfit_id", 11]]
---
                <ul>
                <%@outfit.items.each do |item|%>