app/views/outfits/show.html.erb

        <div class='all_items'>
            <%@outfit.items.each do |i|%>
---
SELECT "items".* FROM "items" INNER JOIN "outfit_items" ON "items"."id" = "outfit_items"."item_id" WHERE "outfit_items"."outfit_id" = ?  [["outfit_id", 19]]