app/views/users/edit.html.erb

SELECT "outfits".* FROM "outfits" WHERE "outfits"."user_id" = ?  [["user_id", 7]]
---
<ul>
    <%@user.outfits.each do |o|%>