app/views/users/show.html.erb

SELECT "outfits".* FROM "outfits" WHERE "outfits"."user_id" = ?  [["user_id", 6]]
---
    <ul>
        <%@user.outfits.each do |o|%>