app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def current_user
        user_id = session[:user_id]
        user_id && User.find(user_id)

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
---
    def logged_in?
        if current_user
            flash[:notice] = "You are already logged in."
            @user = User.find(session[:user_id])