app/controllers/items_controller.rb

    def show
        @item = Item.find(params[:id])
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]

    def uniq_users
        array = []
        @item = Item.find(params[:id])
        @item.outfits.each do |o|
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
SELECT "outfits".* FROM "outfits" INNER JOIN "outfit_items" ON "outfits"."id" = "outfit_items"."outfit_id" WHERE "outfit_items"."item_id" = ?  [["item_id", 3]]