app/controllers/outfits_controller.rb

    def index
    @outfits = Outfit.all
---
SELECT "outfits".* FROM "outfits"

def show
    @outfit = Outfit.find(params[:id])
---
SELECT  "outfits".* FROM "outfits" WHERE "outfits"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

def create
    @outfit = Outfit.new(params.require(:outfit).permit(:name))
    @outfit.user_id = session[:user_id]
    if @outfit.save
---
INSERT INTO "outfits" ("name", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "new outfit 2"], ["user_id", 7], ["created_at", "2019-08-23 13:37:12.495044"], ["updated_at", "2019-08-23 13:37:12.495044"]]

def edit
    @outfit = Outfit.find(params[:id])
    @items = Item.all
---
SELECT  "outfits".* FROM "outfits" WHERE "outfits"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
SELECT "items".* FROM "items"

def update
    @outfit = Outfit.find(params[:id])
    @item = Item.find(params[:outfit][:id])
    @outfit.items << @item
---
SELECT  "outfits".* FROM "outfits" WHERE "outfits"."id" = ? LIMIT ?  [["id", 19], ["LIMIT", 1]]
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
INSERT INTO "outfit_items" ("outfit_id", "item_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["outfit_id", 19], ["item_id", 15], ["created_at", "2020-09-19 20:37:53.398169"], ["updated_at", "2020-09-19 20:37:53.398169"]]

def destroy
    @outfit = Outfit.find(params[:id])
    @outfit.destroy
---
SELECT  "outfits".* FROM "outfits" WHERE "outfits"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]
DELETE FROM "outfits" WHERE "outfits"."id" = ?  [["id", 15]]