app/controllers/users_controller.rb

    def create
        @user = User.create(user_params)
---
INSERT INTO "users" ("first_name", "last_name", "age", "bio", "created_at", "updated_at", "username", "password_digest") VALUES (?, ?, ?, ?, ?, ?, ?, ?)

    def set_user
        @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]