app/models/category.rb

    def self.most_items
        max_num = @@all.map{|c| c.items.count}.max
        @@all.find{|c|c.items.count == max_num}.name
---
SELECT "categories".* FROM "categories"
SELECT COUNT(*) FROM "items" WHERE "items"."category_id" = ?  [["category_id", 1]]

    def self.fewest_items
        min_num = @@all.map{|c| c.items.count}.min
        @@all.find{|c| c.items.count == min_num}.name
---
SELECT COUNT(*) FROM "items" WHERE "items"."category_id" = ?  [["category_id", 1]]