app/models/item.rb

  def self.most_popular
    #most popular item for users
    user_outfits = User.all.map{|u| u.outfits}.flatten
    user_items = user_outfits.map{|o| o.items}.flatten
---
SELECT "outfits".* FROM "outfits" WHERE "outfits"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users"
SELECT "items".* FROM "items" INNER JOIN "outfit_items" ON "items"."id" = "outfit_items"."item_id" WHERE "outfit_items"."outfit_id" = ?  [["outfit_id", 1]]

  def self.least_popular
    #least popular item for users
    user_outfits = User.all.map{|u| u.outfits}.flatten
    user_items = user_outfits.map{|o| o.items}.flatten
---
SELECT "outfits".* FROM "outfits" WHERE "outfits"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users"
SELECT "items".* FROM "items" INNER JOIN "outfit_items" ON "items"."id" = "outfit_items"."item_id" WHERE "outfit_items"."outfit_id" = ?  [["outfit_id", 1]]

  def self.most_sought_after_brand
    user_outfits = User.all.map{|u| u.outfits}.flatten
    user_items = user_outfits.map{|o| o.items}.flatten
---
SELECT "outfits".* FROM "outfits" WHERE "outfits"."user_id" = ?  [["user_id", 1]]
SELECT "users".* FROM "users"
SELECT "items".* FROM "items" INNER JOIN "outfit_items" ON "items"."id" = "outfit_items"."item_id" WHERE "outfit_items"."outfit_id" = ?  [["outfit_id", 1]]