app/models/style.rb

    def self.most_items
        max_num = @@all.map{|s| s.items.count}.max
        @@all.find{|s|s.items.count == max_num}.name
---
SELECT "styles".* FROM "styles"
SELECT COUNT(*) FROM "items" WHERE "items"."style_id" = ?  [["style_id", 1]]

    def self.fewest_items
        min_num = @@all.map{|s| s.items.count}.min
        @@all.find{|s| s.items.count == min_num}.name
---
SELECT COUNT(*) FROM "items" WHERE "items"."style_id" = ?  [["style_id", 1]]