app/models/user.rb

    def self.most_outfits
        max_num = self.all.map{|u| u.outfits.count}.max
        self.all.find{|u| u.outfits.count == max_num}.formalize
---
SELECT "users".* FROM "users"
SELECT COUNT(*) FROM "outfits" WHERE "outfits"."user_id" = ?  [["user_id", 1]]