app/views/application/analytics.html.erb

        <h3>Categories</h3>
        <h5>Total Categories: <%=Category.count%></h5>
---
SELECT COUNT(*) FROM "categories"

        <h3>Styles</h3>
        <h5>Total Styles: <%=Style.count%></h5>
---
SELECT "styles".* FROM "styles"
SELECT COUNT(*) FROM "styles"

        <h3>Items</h3>
        <h5>Total Items: <%=Item.all.count%></h5>
---
SELECT COUNT(*) FROM "items"