app/views/layouts/application.html.erb

        <%if current_user%>
        <%= link_to("Profile", user_path(User.find(session[:user_id])), class: "item") %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]